# ContinuousFootingTopToe Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousFootingTopToe Property
ParameterTypeId Class See Also
---
"Toe Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousFootingTopToe { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousFootingTopToe As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousFootingTopToe {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace